{"podcast_details": {"podcast_title": "WSJ’s The Future of Everything", "episode_title": "The Sensors Helping Farmers Adapt to Extreme Weather", "episode_image": "https://megaphone.imgix.net/podcasts/914e8e84-33f5-11e7-92ed-d799e1f645ed/image/future-of-everything-v4.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Join the Wall Street Journal online October 12th for WSJ Pro Sustainable Business Forum and take away practical advice on how to build a sustainability strategy that's right for your business. From now until September 21st, you can save 25% on your ticket by registering at wsj.com slash sustainable business. No code required. That's wsj.com slash sustainable business. Kyle Bridgeforth is a fifth generation farmer who grew up helping out at his family's farm in and around Tanner, Alabama. 150 years ago, his great-great-grandfather, a former slave, began buying farmland in North Alabama. And now, Bridgeforth Farms is growing a variety of crops. Currently, our biggest crop is cotton, but we also have corn, soybeans, a winter wheat crop, and occasionally grow canola and grain sorghum. When you walk around Bridgeforth Farms, you'll not only see this wide array of plants, but you also might notice something stuck in the ground. It almost looks like someone left their Bob the Builder construction hard hat sitting in the field. But it's actually a sensor, and next to it is a big green box attached to a tall metal pole with a solar panel on top and a lot of wires connected to it. Is it a phone line? Cable TV? Actually, it's a high-tech monitoring system. You see, while Bridgeforth grew up helping out on the farm, now he's in charge of more than 10,000 acres. And to manage all that land, he's using technology, including moisture sensors that work hand in hand with irrigation systems so farmers can grow large amounts of healthy plants. All these technologies are combined together so when the irrigation is fully saturated in the field, the soil moisture sensor will then tell the irrigation system to stop. Bridgeforth says the system saves him a lot of work, but the benefits of these sensors go beyond just that. It's given you the ability not to overwater. It's much more efficient, much more sustainable. And that allows the farm not only to cut its water bill, but also reduce the amount of water it's taking from the ground. When you think about farming, you may think of the old farmer's almanac. Wisdom and intuition passed down from generation to generation. Bridgeforth says, although that's how his ancestors might have farmed, today, not so much. Farming was very much some art back then when it's evolved into more of a data science that is today. And the next generation of this tech promises to do even more. Imagine sensors that are the size of bandages stuck to individual leaves, telling farmers when the plants are sick or need water. That kind of technology is in the works right now. From the Wall Street Journal, this is the future of everything. I'm Jaila Everett. Today, we're talking about sensor technology made for plants. While it promises to help farmers adapt to rapidly changing conditions, it comes with a high cost. Stick around. Kyle Bridgeforth installed his soil moisture sensors in 2013, and he says they help him do two important things. Get the most use out of his land and use as few resources as possible to do so. On his farm, Bridgeforth uses sensors to tell him information about his soil that he can't see. It's stuck in the ground. When the water starts flowing onto the field, it'll start measuring the depth of how saturated the soil is. So has the water saturated three inches into the soil? Is it 10 inches into the soil? And then based on your soil type and the plant that you're growing, you can decide at what depth do I want this irrigation system to shut off. Bridgeforth pairs the data he gets from this technology with considerations of the soil type and plants being grown. And from there, these soil moisture sensors help him decide when the best possible time for irrigation is. Researchers say systems like the one Bridgeforth uses help conserve water, save energy, and decrease fertilizer requirements. The technology has evolved since it was first rolled out decades ago. In the early 1990s, some farmers used sensors mounted on top of tractors to gauge soil organic matter. Those sensors required specific calibrations and were sensitive to soil moisture levels. Sensors today are more advanced and provide information on wind, latitude, longitude, soil moisture, chemicals, stresses, and more so that farmers can make informed decisions. And because the data these sensors collect varies, the solutions they provide do too. Bridgeforth is among a small community of farmers using the tech. A 2022 survey by McKinsey & Company found that only 15% of farmers globally have adopted remote sensing and precision agriculture hardware. This low adoption rate isn't because farmers aren't open to innovation. The survey found that many are, but McKinsey noted that farmers have questions like, what is the return on investment? What about data privacy? How complex is it to set up and use this? How much does it cost? As you can imagine, there are the slow adopters, the ones that have to see the neighbor to implement. That's Bruno Basso. He studies the intersection of sustainable agriculture and digital technology at Michigan State University. And he gave some reasons why farmers may be hesitant to install the latest generation of high-tech sensors on their farms. Farmers look for what we call turnkey solutions. So they need support from companies that doesn't necessarily add an additional level of complexity to their daily life, but provides a potential solution because the complexity is pretty high. Many farmers already do a lot. Kyle Bridgeforth, for example, says he is responsible for overseeing equipment, managing data, harvesting, planting, irrigating and more. So any new system has to make some part of that work easier. That means getting a strong return on investment, which can be tough because the sensors like the ones Bridgeforth uses are expensive. With all things, the more technologically advanced, the more operational increases you can find from it, the more expensive it's going to be. Bridgeforth wouldn't tell me how much he spent, but he did tell me he uses John Deere's Field Connect system. John Deere declined to share its pricing with us, but competing systems can run into the tens or hundreds of thousands of dollars. Here's one example. A similar soil moisture monitoring system can cost anywhere from $1,500 to $1,800 to install. That includes one soil moisture probe that monitors around 80 acres. And the weather station, which collects the data from the sensor, can cost anywhere from $2,500 to $3,500. To cover a 10,000 acre farm, you'll need around 125 probes and two weather stations. So we're talking around $190,000 at the low end, and that's just to measure the moisture in the soil. But Bridgeforth says the system he installed was worth the investment as he deals with increasingly unpredictable weather. I think it's affected everyone. Even trying to pinpoint heat units, drought, it's just been much more erratic. What we expect to traditionally be a wet season hasn't been a wet season. A brutal heat wave across the South and West is causing dangerously hot temperatures and killing crops. Every day, it seems like recently, another round of storms leads to another afternoon feeling helpless. Just north of New York City, parts of the Hudson Valley saw once in a millennium levels of rainfall. When you're in an erratic environment for plants, then they start to make decisions. They decide we're going to abort part of the production process because the water and nutrients aren't there. So it does affect yield. Crop yields refer to how much of a crop is produced by a farmer per acre of land. And while Bridgeforth says that his sensors and irrigation systems have been foundational in helping him extract as much yield as possible out of his crops, there are many farmers that are seeing their yields decrease due to unpredictable weather. The extreme events are affecting agriculture on both ends. More frequent droughts, more frequent excessive amount of rain, which impacts farmers in making the decision when to plant, where to plant, if they can plant at all. And so the cost is significantly higher. Bruno Basso at Michigan State says the effects of unpredictable weather are leaving farmers with some hard choices to make regarding how to manage plant health. Agriculture is extremely vulnerable to what is happening. The immediate impact is a lower yield. He says plants experience stress from a variety of environmental conditions, like intense heat, which can stunt plant growth, and excessive rain, which can wash away essential nutrients in the soil that are vital for photosynthesis. But future sensors might help farmers identify these stressors in real time, which can make addressing the needs of the plants a lot easier. But to get there, Basso says there's work to do. The sensing are becoming so much more reliable and they last longer and they can detect much more in terms of feedback, whether it's, again, nutrients or potential diseases. The sensing world in general, it's still in a development into a scalable, immediately scalable format. Sensors can help farmers weather the unpredictable. But to do this, researchers are getting up close and personal as they develop the next generation of sensors. So close that the sensors can be worn by the actual plant, almost like a bandage. That's after the break. We've talked about sensors and what they can tell farmers about their land. But what if the sensors weren't just in the soil, but on the actual plants? Ching-Shal Wei is an assistant professor at North Carolina State University's Department of Chemical and Biomolecular Engineering. In Wei says there's a lot of potential in crop monitoring and sensing. It's our long term interest to try to create some diagnostic tools for farmers and growers. So Wei and his team have created a sensor that the plant actually wears. Wearable is a more science community acceptable term. Sometimes we call them plant bandage or something. Plant bandages. Wei's sensors are very small and lightweight. Think the size of a stamp. They are made with gold, silver and carbon nanomaterials that are within a polymer that attaches to the plant. Almost like a tiny bandaid. And unlike the sensors Bridgeforth uses at his farm, these sensors allow real time tracking of the plant's health. They monitor volatile organic compounds, also called VOCs, that are released from plants when they experience stress. The sensor is also able to monitor several other physiological parameters, such as temperature, humidity, that's related to the microclimate of the plants. In an early study, Wei's team tested the sensor on tomato plants in a greenhouse. But Wei thinks this technology could be used on a variety of plants. Tomato is just our initial proof concept crop system. And then I would say in principle, the wearable sensor device can be applied to many different crops for many different applications. Wei says his sensors, if they come to market, could have benefits for farmers trying to figure out what's going wrong with their crops. Whether it be communicating when the soil is too dry or alerting a farmer when they can hold off on applying pesticides. So really more precision control on the plant growth and management. And then I think that approach could promote plant growth. It would give farmers even more information about their plants so that they can make informed and environmentally conscious decisions. Which means that in the future, farmers could potentially pick up a tablet, virtually look at their fields and get alerts on certain plants that are in need of watering or that are developing diseases. But there are still some big questions about how to take this design from the lab to the farm. Like the price. Wei says each sensor costs $2 to make. But even if farmers could buy them for that amount, putting them on thousands of plants could total up to millions of dollars. And scaling. Because while the sensors worked for monitoring tomato plants inside a greenhouse, could the design withstand heat, rain, hail, and freezing temperatures? And connectivity. Farmers in rural areas might not have access to high speed Internet to support this wireless and cloud based tech. Not to mention other logistical questions like who will manage the sensors on the farm? Who will walk through the fields to put them on each individual plant? And who will remove them during harvest? Can they even be reused? Again, the tech is still in development and there are many caveats. But remember Bruno Basso at Michigan State who studies sustainable agriculture and digital technology? He says these kind of sensors could provide farmers with options. It's not just about in season decisions. Maybe there is nothing you can do, even if you have the sensors. But the knowledge of alternative routes and knowing that beforehand are very helpful to a farmer. But when it comes to putting these sensors into widespread use? The scalability of the sensors is complex. Because in general you have to account for a cost associated to the sensors. Now we're talking about several years down the road. And he's not the only one concerned about cost. Bridgeforth, the farmer in Alabama, talks to a lot of growers. He's involved in initiatives like Black Collective, a group committed to helping farmers adopt sustainable techniques. And he says he hears the same thing over and over. That costs are standing in the way of more farmers bringing sensors to their fields. It goes back to how limiting this expensive technology can be. Especially for smaller stakeholder farms and black farms, minority farmers that typically aren't at a humongous scale. It can be cost prohibitive to go out and use the best technology. Earlier this year, the U.S. Department of Agriculture announced $40 million in grants for climate smart farming research. Over $2.2 million of that was for sensing technology, including projects at the University of Florida and Florida International University. Kyle Bridgeforth says, sensing tech is a step into a new age of farming that is data driven and precise. And he says wearable sensors have the potential to innovate how farmers work. As far as managing plant health goes throughout the growing cycle, I think that's where the future is. We want to make sure that everyone has access to the best technologies so that they can have the most productive farm. The Future of Everything is a production of The Wall Street Journal. Stephanie Oganfritz is the editorial director of The Future of Everything. This episode was produced by me, Jayla Everett, with help from Alex Osala and Charlotte Gartenberg. Our fact checker is Aparna Nathan. Michael Laval and Jessica Fenton are our sound designers and wrote our theme music. Scott Salloway and Chris Sinsley are the deputy editors. And Philana Patterson is the head of news audio for The Wall Street Journal. Like the show? Tell your friends and leave us a five-star review on your favorite platform. Thanks for listening.", "episode_audio_url": "https://pdst.fm/e/chrt.fm/track/1F1B1F/traffic.megaphone.fm/WSJ1906623110.mp3?updated=1691748313"}, "podcast_summary": "In this episode of \"The Future of Everything\" podcast by The Wall Street Journal, host Jayla Everett explores the use of sensor technology in agriculture. The episode features Kyle Bridgeforth, a fifth-generation farmer from Bridgeforth Farms in Alabama, who discusses the benefits of using soil moisture sensors to optimize irrigation and conserve water. The transcript also mentions Bruno Basso, a researcher studying sustainable agriculture and digital technology at Michigan State University, who highlights the challenges and costs associated with implementing high-tech sensors on farms. Additionally, the transcript introduces Ching Shou Wei, an assistant professor at North Carolina State University, who is developing wearable sensors that can be attached to plants to monitor their health in real-time. While the technology shows promise, there are still concerns about cost, scalability, and connectivity. Overall, the episode explores how sensor technology in agriculture can help farmers adapt to changing conditions and make more informed decisions, but acknowledges the barriers that limit widespread adoption.", "podcast_people": "Hosts:\n- Jayla Everett\n\nStarring guests:\n- Kyle Bridgeforth (farmer)\n- Bruno Basso (professor at Michigan State University)\n- Ching-Shal Wei (assistant professor at North Carolina State University's Department of Chemical and Biomolecular Engineering)", "podcast_highlights": "Key moments from the podcast transcript:\n\n1. Kyle Bridgeforth's use of sensor technology to manage his farm's irrigation system efficiently and sustainably. (Timestamp: 0:57-3:07)\n2. The evolution of sensor technology in agriculture and its benefits in conserving water, saving energy, and reducing fertilizer requirements. (Timestamp: 4:12-7:14)\n3. The low adoption rate of sensor technology by farmers globally due to concerns about return on investment, data privacy, complexity, and cost. (Timestamp: 10:11-14:08)\n4. The high cost of advanced sensor systems, with examples of pricing for soil moisture monitoring and weather stations. (Timestamp: 14:38-16:37)\n5. The impact of unpredictable weather on crop yields and the need for sensors to help farmers address plant health and make informed decisions. (Timestamp: 17:16-19:17)\n6. The development of wearable sensors that can be attached to plants to monitor their health in real time, with potential benefits for precise plant growth and management. (Timestamp: 20:34-23:07)\n7. Challenges in scaling wearable sensors, including cost, durability, connectivity, and logistical considerations. (Timestamp: 23:39-26:49)\n8. Concerns about the cost barriers faced by smaller stakeholder farms and minority farmers in adopting expensive sensor technology. (Timestamp: 27:55-29:12)"}