{"podcast_details": {"podcast_title": "30 Minutes of Football - Live NFL Podcast with Legit Football", "episode_title": "🏈30 Minutes of Football: August 16th, 2023⏲️", "episode_image": "https://storage.buzzsprout.com/variants/cbsbu3i01mu4hwv0axspjimkykla/e70382d1824eed07bf51f8b9742413cd1ad490e9f893e8ff33e49d552d3c73ea.jpg", "episode_audio_url": "https://www.buzzsprout.com/2007873/13425433-30-minutes-of-football-august-16th-2023.mp3", "episode_transcript": " Ladies and gentlemen, boys and girls, children of all ages, welcome to 30 Minutes of Football, a legit football NFL podcast. I am your host, Kevin Philip Fox, and I am joined by the illustrious, by one who many have called the goat producer, many being me. His name is Anthony Weiner and he's here for you. Anthony, how the hell are you? I'm great. I was watching a lot of preseason football and then watched a lot of highlights and just seeing any football is really making me excited. So I can't wait to start talking about regular season football, but I'll take what I can get at this point. Dude, the juices are flowing again, man. We're getting our way back into the groove of things, you know. It takes time. Armand already in the chat with his signature, what's up, shouting out K-Fox and A-Train. I can dig that nickname for you, Anthony. By the way, I could dig it. I'm always going. I like that one. So, Andy, why don't you get the timer going? We have our looser show tonight, as always. Thirty minutes of football. The rule, only rule is there are no rules and have fun and be reckless and enjoy. I'm talking to you guys from AirPods, so I feel like a rich king. You know, my headset yesterday had not the best audio, so we're coming at you with some new game. We do, baby. So, Anthony, why don't you kick us off? Start our timer. Thirty minutes and I'm going to put the ball in your court. Great. I'm going to let you decide where we take this puppy. Thirty minutes of football starts now. The whole time that I've been doing the show with Brian, he has said 30 minutes of football starts now. And that's the first time that I've got to say that in my phone. And you nailed it, too. I could tell you were practicing. Yeah, I was practicing in front of the mirror for like an hour earlier. Big time. And you nailed it, man. All right. So, Kevin, you put me first. So I'm going to ask you this as a teaser for tomorrow's episode, which Adrian and I are going to be talking about preseason players to watch. So speaking of that, I want to know who are your preseason players to watch? Oh, man. Thank you. Let's go a little teaser. I love that. As anybody who listens to the show knows, I make it to every show that I can. I'll be traveling for tomorrow's show, so I will be missing it. I will listen, as I always do, to my boys, Anthony and Adrian. Preseason players to watch, Anthony. Man, there's so many good ones. I'm mostly paying attention to the rookies. I would say more than anybody. I want to see. I want to know who is your most to watch? Like, who's the one? If you could name one who was after after the first preseason game and what I saw out of CJ Stroud, I want to see a little bit more out of him. You know, I'm a Texan truther. They're my you know, they're my favorite team. They're my they're my self favorite team. Right. So what's something I think he can improve on because he made a lot of mistakes. But I've been saying preseason is the place to make mistakes that we got them. And I think that CJ's shot the big example of that. We haven't seen him in fast paced regular season football yet. We've only seen him in preseason football where things are just a little lighter. And so is this a thing, you know, kind of a crystal ball for things to come or should we just not be worried or like, are we overreacting here? Yeah, I'm inclined to think that we're not overreacting because there's just a growing pain that just there's just growing pains that just naturally happen. So I'm inclined to think that CJ Stroud actually does have some strides forward that he needs to take. But as the guy who's been banging the drum and believing in Houston so much, I need to see it. So CJ Stroud is going to be my number one player to watch for the preseason. Anthony, who's your number one player to watch? Give me a give me a spoiler for tomorrow's episode. A player that I think needs to be kept an eye on is Anthony Richardson. Yeah, because he came out and the Colts fans were so excited and he didn't perform. And I think that, like I said, preseason is preseason, but you still want your quarterback to perform the guy that you just, you know, put a lot of draft capital on the guy who you sacrificed a lot for you, mortgage your whole future on this quarterback who could be your franchise quarterback. But he was making throws. He was seeing ghosts. He looked confused out there. He didn't look comfortable at all. But the reason he's a player to watch for me is it's just I think he has the potential to improve even more than CJ Stroud. He has the potential to improve. And I think that he will improve. Yeah, he has the traits. I mean, he has the traits that are the dream. He's the prototypical NFL quarterback, if you could build one. And I'll disagree with you a little bit because I think his numbers didn't look great. But he did drop one in the bucket that was dropped down, I want to say, at the five yard line and I believe it was by Alec Pierce. It was like a corner route right in front of one of the pylons in the end zone. He put it right where he was supposed to and his man didn't come up with it. And on the pick, which was an ugly pick, to the naked eye, it looked horrible. There's talks and Jimmy Ray was sort of seconding this yesterday. There's talks that maybe it was a miscommunication or maybe the receiver ran the wrong route and it wasn't a problem with the throw. So I think it's super fair to criticize him. He could have been better. Didn't score a single point to my recollection or maybe. Yeah, I don't think he scored a single point. No, he didn't. You know, to be fair, Buffalo has a great defense, but he does have to be better, Anthony. But I'll give him a little bit of a pass, right? Like I'll be nice. Right. Exactly. And that's why he's my player to watch is because I think it was a fluke. I think that he can still perform to a professional level. And so I'm here to see it. Yeah, absolutely. And I think we're going to say the same thing about a player like Bryce Young, you know, with Carolina. It'll be really exciting to see. And another one, Anthony, Justin Fields. He looked sharp. Is that a flash of the pen? I mean, it was almost shocking because I'm watching him. Like, wait a minute, like a real question. And I'll stay it again. Like what's going on here? Like last year, he was so like off his game the whole season. Yeah, team was. And to see him just go out, it's almost like I have a chip on my shoulder and I want everyone to see it. And so now he's I'm going to be the guy that I got drafted for. And I think that he's also a player to watch just because of that is because it's been what's he in his third year now. I think that now is the time to prove to not only Bears fans, but to the entire NFL that he's the quarterback he was drafted to be. And in that preseason game, I think that was the start of that. Yeah. And I do want to highlight Armand is pointing out some really, really sad news. There was an injury. I suppose Russell Gage out for the year didn't hear that. That's tragic. Javelin Gidry out for the year. Tragic. Just not good camp. You know, it's the one goal of every camp, you know, you want to make your team better. You want to this that in the third. No, you want to get out healthy. Losing key contributors in camp and in practice and in preseason is sickening. But it happens every year. And it's just the name of the game. I shout out to Mike here. Went down Mike with a yes. Trelaun Burks with the LCL. I guess he's only out for a few weeks, though. Turns out it's going to be. Yeah. He's knocked out by himself, so. It's not ideal, but it's it's yeah, it's it's clearly not an ACL or an MCL. So but you hate to see he was already kind of on shaky grounds for me, especially. It seems to me too. Yeah, because they already say if you know, they didn't bring in Deandre Hopkins, I might be a little higher on Trelaun Burks. I was a little interested in seeing what the breakout looked like. But the breakout potential, it's been hampered even more by this. But Mike Elmore here in the chat from Facebook. What's up, Mike? Thank you for being here. Trey Lance is the elephant in the room. Yes, Anthony, why don't you give me your your rapid fire takes on Trey Lance? I think he needs to be traded. I think if he sits behind Brock Purdy, who they have proven is their clear quarterback one, it's been said multiple times now, he's going to be sitting in the back without an opportunity to play. It's gonna be like Tom Brady where blood so never got hurt. There's there's hidden talent there that's not being allowed to show. It's not being allowed to. He's not able to play. He's not able to be like, all right, well, I play professional football and this is why. And not giving him the opportunity, I think means he needs to be traded. And if he doesn't request a trade and end up in free agency, but still has to be a 49er for a whole year sitting on the bench and playing with the practice squad, then he might as well just retire because now that's almost I mean, that's too many years in to not even snap a ball as a starter. It doesn't help that he got hurt. And that's not you know, that's just unfortunate. We hate injuries here, but now he's not hurt. So let's let him play. And Shanahan is not going to do that. So I say trade him. I think it's pretty important to and this is something that me personally as an idealist and as somebody who just loves traits, I tend to put this on the back burner. But Brian McFadden has sat on the show a hundred times till he's blue in the face. They see who that dude is in practice every single day. And we've seen him now in game action, what, three or four times, a couple of games last year, a couple of preseason games the year prior. And now and now this and it's just like, do we know who Trey Lance is? Has he been showing us who he is for years? Is he just not that guy? Is San Francisco just not a fit? Like you can't you can't have the traits that he has. They don't go away in a couple of years. Like theoretically, if he's that guy who they drafted, he's that guy who they drafted, but it hasn't manifested even in the slightest. I tend to agree with you, Anthony, and just think, you know, sometimes a flower needs the right soil to grow. And maybe Trey Lance is just not getting that soil. I like that. I like that analogy because you're absolutely right. If you block a flower from the sun, it's not it's going to wither. And that's what's happening to Trey Lance. They're blocking the sun. And I think that if he does end up in a team or on a team within an organization who's going to utilize him, that's where he's going to grow. That's where he's going to see. You're not going to grow sitting behind Sam Darnold and Brock Purdy. That's not going to happen. You're not going to grow there. So will they trade him? Probably not, because like you just say they see him practice every day. They're probably just going to keep him behind Brock Purdy and say, hey, if Purdy goes down, we got a guy. But just imagine that, Anthony, like think about what they think about what they trade. They traded, I want to say, two picks, two first round picks to get there, to get to the third overall pick to draft him just to do this. I mean, I know this wasn't the plan, but at what point? I mean, the sunk cost fallacy is something that people talk about all the time. Doesn't matter what you invest in something. It is what it is. If you're looking at assets in a strictly black and white standpoint, then it doesn't matter what they spent to get him. If he's not the guy for the job, he's not the guy for the job. Exactly. Yeah. Nobody will respect that more than Kyle Shanahan. Reve first round picks to get up to three to draft trade Lance. And now he's just I think it's like it's coincidentally organizational because you do that. You trade three first round picks for this guy. But then you get this undrafted guy who just shows up and plays really, really well. You don't know that that's going to happen until it happens. And it was unfortunate that Trey Lance was hurt at that time or Brock Purdy may have never emerged. Right. You know what I mean? So I think that it's all just it's all the dominoes fell and then one domino didn't. And yes, that one domino that hasn't fallen yet because San Francisco on the way, they have a great team, a stacked roster. Brock Purdy is a great quarterback. They have Christian now. And so Trey Lance, do we keep him in the conversation for for how long are we just going to keep having this conversation for the next two years or like what's going to happen here? He's a former first round pick, right? I mean, we probably will until we know for sure what he can be with an opportunity. We probably will continue to have this conversation. So I pinned Arman's comment. Who trades for Lance? See I asked that question, but I haven't thought about that. I think a team right. So I don't know really where Tennessee is heading in the future with the quarterback position. Malik Willisk has been stepping up lately. He had a great preseason game. He's apparently looking in practice significantly better than Will Levis. We knew Will Levis was going to take time to develop. He was always a raw prospect. It's a good thing for him that he's not rushed into a starting job. Tannehill is on his last legs, really. I mean, year or two left, Max. I don't know. Does Trey Lance go to Tennessee? Does Trey Lance go to like Minnesota who is like, you know, thinking about moving on from Kirk after this season? Does a team like the Vikings take a chance on him or does he go and be one of those like high pedigree, maybe high paid backups? You know, like where. But is that any different than the situation he's in now? There's a lot going on here. And Mike is an elephant in the damn room. We're all thinking it. You know, we're all like, Trey Lance. I wake up in the morning, I'm like, what is going on with Trey Lance? It's not we won't know until we know. And until he gets a real shot, we won't know. And we'll keep speculating. And that's where the tea leaves come in, where the one place where I tend to on this situation sort of take a negative, more pessimistic approach. This is the McFadden theory is that they know he sucks and they've seen him in practice and they've seen him in games and he's not the guy who they thought they drafted. And that's why he's not saying to feel that simple. And like I said, it's pessimistic and I tend to want to believe more. It's kind of realistic, too, though. It is. In this case, with what we've seen, it might just be real. I mean, he that pick that he that he didn't throw that turned into a touchdown pass was an atrocious pass. And he made he got sacked a lot, his pocket presence was terrible. Here we go. Miami receives the 12th overall selection from San Francisco, a third round pick and first round picks in twenty three twenty two and twenty three. The Dolphins traded. Yeah, the number 12 pick and 22 first to the Eagles for the sixth pick. Yeah. What a what a what an unbelievable that's trade. Yeah. I believe that you remember when that happened. And we thought Tralance is going to be like rookie of the year. Yeah. And we're like, go like everyone's drafting him in dynasty, the fantasy drafts. And we just we couldn't stop talking about it was Tray Lance's Tray Lance that and then he went down and it's like, what just happened? Now he's out for the season. And now we're two years later and he still hasn't seen enough playing time. The jury's out and it's like it's been out and I just I don't know if we'll ever be able to truly tie the bow on Tray Lance. It's almost like Schrodinger's cat. You know, you don't know if it's alive or dead until you open the box. And that's where we're at with Tray Lance right now. Yeah. Look at that like pros, Anthony. It's halftime, 30 minutes of football. Anthony, you know what to do. Tell the people who you are, what you're about. Oh, yeah. This podcast that I produce is a podcast about the legit football newsletter, which everybody needs to go to legitfootball.com and subscribe to it. It's email to your email every single weekday. You read it in the morning. It's posted at like 5 a.m. Pacific time. So here in L.A., I get it at 5 a.m. I mean, I've watched football games at 10 a.m. Everything's really early. And so when I'm having my morning coffee, my phone's in my hand and I'm reading the newsletter and I love it every second of it. That was a beautiful halftime speech. And I'll just say I'm super stoked to be here, man. I love 30 minutes of football. Brian and I just talked about it, how it's just chopping. It's the most innocent, least scripted, most, you know, let's see where the conversation takes us, conversation that we have about football. I mean, yeah, we just watched or talked about Tray Lance for the last five minutes. Yeah, Tray Lance. Well, and we had to address it because Mike, a devoted listener is in the chat. We had to give him to his due. Armand, I'm looking at you for the second half. I need you to come up big. Ask some good questions. Give us some good prompts. Anthony, 15 minutes of football starts now. All right. So, Kevin, in the second half, I want to know what team surprised you the most in week one? Oh, thank you so much because I had a question for you. I'll get to mine in a second. I'll answer your question. And we sort of already talked about it, but I was very surprised to see the first team offense for the Chicago Bears humming the way that it was. Oh my word, Anthony. The Chicago Bears, Justin Fields completed three passes, I want to say, for negative air yards because they were all screens. And he had like two touchdown passes and like almost like a hundred and something yards. And I'm just like, dude, those numbers are so efficient. DJ Moore in the screen game, Khalil Herbert in the screen game. Anthony, this is not your dad's Bears. This is not your older brother's Bears, man. These boys, they might be coming out with something to prove this year. I saw that it was a deep throw to DJ Moore right down the sideline for a touchdown. And I'm like, that's it. That's DJ Moore, Justin Fields thing I was talking about going in after that trade happened. I'm like, it's going to happen. I've been high on DJ Moore. I think Justin Fields is going to do a lot better. He has he has an upgraded offensive line. I think that things are happening in Chicago, which as a Lions fan makes me a little nervous. So but, you know, it's exciting to see because, you know, Justin Fields was an early pick and the same thing with Trey Lance, like you pick someone early, they don't give you what you drafted them for. And I think now he's emerging as that first round draft pick that he was supposed to be. So you're buying the Fields more stack in that. Yes, I am. OK, I'm saying that on record right now. DJ Moore, Justin Fields deck. Oh, here we go. This is a great one. Armand, what player should we watch in the Browns Eagles game? You know, unfortunately, until we know what we got in this player, I think we have to watch Deshaun Watson. I think we have to see who this guy is on the field. If he's his old self that was balling out in Houston or if he's the shell of himself that we saw in Cleveland last year. Week one was nice. He got to a nice little start. But he's got. A way to go, right, to remind us of who he was in Houston. So I would say Deshaun Watson first. Anthony, any any names that are jumping out to you? Yeah, Deshaun Watson. I have to agree with you. I mean, I think that's the most important right here. Yeah. Oh, Deandre Swift. If they play him because he was he wasn't as productive in Detroit as he was supposed to be. He dealt a lot of injuries. Kenneth Gainwell now has that running back one spot. So now Deandre Swift has to go out and try to win it. And so will he or will he fly? And they have a good running back room. So there's a lot of running backs to choose from. So how many targets is he even going to get? So I think he's very important to watching that game just so we can see what. And Brown's rush defense is not terrible. So if he can break through that rush defense and really shine as the running back he was when he was drafted by Detroit, I think that that running back one situation conversation might go a different direction. Yeah. And I also really love that's a good point. And I also really love Elijah Moore, wide receiver for Cleveland traded to them from the Jets, Armand's team. So he's an interesting watch because his talent has always been really high. And everybody thought, when's the moment going to come in New York? When's the moment going to come in New York? There was complaints from him. There was trade requests. It got ugly. And we're finally at a point now with Elijah Moore where he has a clean slate. And I'm wondering, does this guy go out there and show us what he's made of and show us why he was drafted as high as he was? Or does he go out there and show us that the Jets were right to keep him on the bench? So I think Elijah Moore is another name I'll throw out there. Anthony, any more from that game? No. I mean, the Eagles, I think they have it all figured out. I'm just watching the defense. I want to see, yeah, the Bulldogs. I want to see Jalen Carter because apparently this guy is just the most unblockable dominant player in every practice. And we knew he would be in the draft. And I saw a tweet today where somebody was like, let's not treat them like they're geniuses for drafting him. We all knew he was going to be great. It was just the reason they didn't was because of that scandal, the off the field stuff. So I still feel like we all respect where it's due. I mean, Howie Roseman is Adrian's man crush and arguably the best GM in the NFL. So we do have to give credit where it's due, but also at the same time, Philly's proven that they have a locker room stable enough that they're not worried about taking on a character concern or two. Right? Absolutely. Yeah. I'm with you. Yeah. And Armand did not hear about this, but Elijah Moore apparently has a rib injury. We'll see. I mean, yeah, if he's if he's if it's risky for him to get re-injured, then yeah, keep him out. You know, you don't want to. Yeah, absolutely. Because preseason, you don't want someone to go down before they even get a chance. Yeah, that's that's no bueno, as we say in Espanol. Mr. Anthony, what team surprised you most the first weekend of preseason? That's a good question. And I'll tell you this. The Chicago Bears. I know we were just talking about it, but it was the Chicago Bears. But since you already said that, I will come up with one. The New Orleans Saints. Mm hmm. So they they beat the Chiefs. Yeah. And Derek Carr looked incredible. He looked so comfortable out there in a Saints uniform. Chris O'Lavie, I think, brought in some of his before they benched him. But yeah, I mean, Kamara played. He did all right. Jamal Williams. I think he got like 60 plus yards. They're really connecting on the offense and the defense. They they they look like they're having fun out there. They were ready to play. I know it's only preseason, but they wanted to be there. And I think just seen and I said in a show last week, I said New Orleans is the playoff team of that division. And I think I saw a little glimpse of that. And so I was kind of excited to see that. And I will admit, I was very surprised. I I thought I mean, I I have my predictions, but I always like to keep take it easy because I'm never right. Are you confident enough in New Orleans being your flag plant division winners or not quite? Yes. Yes. I have to go there. I think I am. They are winning the division. I'm planting the flag that the New Orleans Saints are winning the division. I love it. I love the confidence. We have a shout from our mom. The Panthers offense surprised him. Yeah, I'm expecting good things. I wouldn't say big things or elite things. I wouldn't say top. I don't think they're going to be a top five offense, but I love the addition of Miles Sanders. I think he is such an underrated piece of what they have going on. It'll be exciting to see if Bryce Young can find some chemistry with Jonathan Mingo and Adam Thielen. Yeah, I wouldn't sleep on the Panthers. I wouldn't sleep on them because Bryce Young was the one on one. He's the, I've said it before, he gives me Mahomes vibes. He's like mini Mahomes, you know? Yeah. He runs around. He's very got a lot of escape ability, elite pocket maneuverability. So you know, Anthony, how do you feel about the Panthers going into the season? I doubted it for so long, but then seeing Bryce Young in the pocket making throws, I'm like, oh, maybe he can pull this off. I was talking to Tyler about the Panthers and Tyler showed me some highlights and he said he looks so comfortable in that uniform. He looks so comfortable on that field and just the way that he just snapped the ball and he was just holding it and he didn't look nervous. His shoulders were down. Like he just looked like he belonged there. And I think that that's, you know, and the offensive line helped. He had a lot of time in the pocket and I think that seems to come. I think that Bryce Young was born for this and he's ready to win with the Panthers. Yeah, if they had a weakness on offense, it would probably be either their weapons or their O line. They do have a way to go, I would say, in that standpoint. I like Ikemukwano, the tackle, but they got some pieces on the line. They got to straighten out. And Thomas, if he were in the chat, he would be able to tell us exactly how they work because Thomas is how, you know, with the Panthers, the way that we are with the Bills and Lions, you know, he's he doesn't miss a snap of preseason or, you know, he knows the name of the backup backup, you know, he knows the name of the waterboy. He don't play no games. So Armand, did they surprise you for good reasons or bad reasons? You'll have to let us know in the chat. But I'm definitely I'm definitely excited to see what they do this year that sort of circling back to our early conversation. Anthony Richardson, Bryce Young, CJ Stroud. Let's keep our eyes glued to these rookie quarterbacks because this is the future. The future is now. You know, we don't have Brady and Philip Rivers and Matt Ryan. We're getting so old, Kevin. We're getting so old. Bro, we're we're washed, bro. We don't have the guys we grew up watching anymore. It's a new guard. It's a new era. And Aaron Rodgers is on his way out. Kirk Cousins is on his way out. They're all leaving. It's all the young guys taking over. 100 percent. And Anthony, let's embrace it, man. Time is a never ending force and you can't stop it. So the only thing to do is join it. Only thing is join it. And so so we're no longer looking at a league dominated by the same three players. It's yeah, Armand, that's what I was thinking. Yeah, the the O-line, like I said, is kind of looking like a little bit of a little sus. That's a place where I'm nervous is if the Panthers don't get their O-line straightened out, they'll be in trouble. But that being said, it's a new guard. It's a new school. Josh Allen, Patrick Mahomes, Joe Burrow, you know, Jalen Hurts, Justin Herbert. These are the guys. This is the next age. And Anthony, which of those three quarterbacks this year do you foresee taking a leap into that category? Oh, that's a good question. It could be a young guy. It could be a young, strutting, Richardson. But maybe it's maybe it's a second year. Maybe it's a third year. Maybe it's just a guy like golf who just was took some time, you know. Yeah, I know. And I've been saying this for a while. I think Jared Goff is going to enter that top tier elite, like top five, like top five. And it's golf. But that really depends on how the offensive line can be health. Well, healthy. A lot of offensive linemen went down last year, which really affected the play at quarterback. Now he has he has St. Brown, which is amazing as a veteran in Marvin Jones. He has Jameson Williams. So he has targets. And so I'm not you know, I'm not. And then Jameer Gibbs, too. He's going to have a big role as a pass catcher. And then they brought in Sam Laporta from the draft, who's also going to have a big role as a pass catcher. So golf's going to have some room to shine. But I, you know, I could talk about that all day. I do think he's going to enter that top tier, but there is a quarterback that I do want to talk about a little bit that was kind of on the down low for a while. Derek Carr. He was just mid tier mediocre for a while. And I think he's going to emerge as one of the best, not not top 10, but maybe top 12. Maybe like number 11 projecting around step forward from Derek Carr. That's pretty interesting. That's I like Derek Carr. Me too. And I always have. I really do. He's getting older. He's a veteran. Yeah. That just means he's been around the game long enough to know how it's played. And I think that using that veteran knowledge, entering a new team with a very young roster is really going to help him succeed. Mike see Mike agrees with me. Yeah, Mike wants to shout out also, he agrees with Anthony's take on Derek Carr, which I do as well. But also there's nobody standing out to him as somebody who will enter that tier. Armand with an interesting flag plant here. Ritter is going to show he belongs as a starting QB with the Falcons. Now of all the young guys who are in the first year starters, Anthony's not agreeing there. I'm just thinking you got Ritter, you got Love, you got you know, all these young guys. All these young guys. What live is if he ever plays? Yeah, right. I just yeah, Love and Ritter are the two that I'm just like, Sam Howell, another one. It's like, I don't really know. Would you pick Sam Howell or Desmond Ritter first to emerge? Ritter or Howell? Well based on weapons, it's hard not to pick Ritter. I just think they have better weapons. But I don't know if either of them are really that good. I know. We'll have to see, but I don't hate to take Armand because if Ritter can just do the Shanahanian, just take the snap and give the ball, you know, if he does the Shanahan flow chart, if this defender goes here, I put the ball here and just, you know, just as smart and just gets the ball to his weapons, Desmond Ritter could have a very, very good career with the weapons that he has around him. I like that take. Can he do it? Right. Like can he, because not everybody can, like some players aren't heady like that. Like Brock Purdy is heady. That's why he's elite in Shanahan's offense because he's so smart. Yeah. All right, well, we have 20, oh, finish your sentence. Yeah, I was just going to say, I think the top six to seven guys are set in stone. I think Mahomes, Allen, Burrow, Hertz, Herbert, Lamar. Yeah. I don't really see any movement within that. Maybe Dak might make his way up there, but I don't think that Dak. All right, 10 seconds left, Kevin. Which team will show the most improvement going into week two? It's got to be the Texans. I think the Texans are going to take a step forward. I like CJ Stroud. Yeah. He had a bad first game. We did it, Kevin. We freaking did it as we always do, Anthony. We did it. 30 minutes of football, a legit football NFL podcast. Your host, Kevin Philip Fox over here, Anthony Weiner, the producer who steps in flawlessly as he's like the Nick Foles of hosts. He'll go in there when you ring. It don't matter if he wasn't planning on jumping on. Mike, you brought the energy in the chat. Mike thinks Tampa's going to improve in week two. Okay. Baker was pretty damn sharp week one. The Baker Truthers on this podcast, like Adrian, like yourself, Anthony, they got a lot of stuff to be excited about because Baker is looking damn good. Oh, for sure. Yeah. Well, we appreciate the love. You're the goat, as you know. How do you feel you performed today? Let's get some post-game press conferences. Oh, bro. We're always going to give it our best and we're always going to watch the tape, try to get better and get ready for the next one, right? What about you? Yeah, I'm good. I feel good about everything that we went over today. I think I liked your takes. I like how you changed my mind on a few things. That's what I love about discussing football is you make such good points where I'm like, huh, maybe I was wrong. Back at you. I may end up to admit when I'm wrong. Back at you. You know I've been a Derek Carr truther forever, so you got me excited for Derek Carr. That felt good to hear it from somebody else because I feel like I've been the only one on this show who's been really, really sharing the love for him. Oh, no. No, I've been. When I saw him get traded, I'm like, finally. Get out of Vegas. It's not working. It's not working. All right. All right. Well, this has been 30 minutes of football. As I said, thank you, Mike, Armand, and Anthony. I'm Kevin Phillip Fox. You've been listening to a legit football NFL podcast and we are out. See you. Why do you hate Terry Kilmer? Wow. I see. Another spoiler. Justin Herbert is on my hot seat. Where they still had Don bravery."}, "podcast_summary": "The 30 Minutes of Football podcast is hosted by Kevin Philip Fox and Anthony Weiner. In this episode, they discuss the preseason games and players to watch. They express their excitement about the upcoming regular season and mention their surprise at the performances of certain teams, such as the Chicago Bears and New Orleans Saints. They also discuss rookie quarterbacks like CJ Stroud, Anthony Richardson, and Bryce Young. They speculate on the future of these quarterbacks and other young players in the league. Overall, they have an engaging and casual conversation about football and provide their insights and opinions on various topics.", "podcast_people": "Hosts: Kevin Philip Fox, Anthony Weiner\nGuests: None", "podcast_highlights": "Highlights from the podcast:\n- Anthony is excited about the start of the preseason and can't wait for regular season football.\n- Kevin and Anthony discuss preseason players to watch.\n- They mention quarterbacks like CJ Stroud, Anthony Richardson, and Justin Fields as players to keep an eye on.\n- The surprise team of the week for Anthony is the New Orleans Saints.\n- They discuss the future of the quarterback position with young players like Jared Goff and Derek Carr potentially making strides.\n- The Carolina Panthers' offense and quarterback Bryce Young are also mentioned as potential risers.\n- The Browns vs Eagles game is highlighted with Deshaun Watson and De'Andre Swift as players to watch.\n- The Panthers' offensive line is mentioned as a concern.\n- The podcast ends with a discussion on which teams will show the most improvement in week two."}