{"podcast_details": {"podcast_title": "30 Minutes of Football - Live NFL Podcast with Legit Football", "episode_title": "🏈30 Minutes of Football: August 2nd, 2023⏲️", "episode_image": "https://storage.buzzsprout.com/variants/cbsbu3i01mu4hwv0axspjimkykla/e70382d1824eed07bf51f8b9742413cd1ad490e9f893e8ff33e49d552d3c73ea.jpg", "episode_transcript": " Wow, I see it. Another spoiler, Justin Herbert is on my hot seat. Yeah, that is the bucks where they still had top rate. Welcome in to 30 minutes of football. I am your host, Brian McFadden, co-founder of Legit Football. It is August. Football games are about to be played. I took a few weeks off, but I came back just in time for some actual football. And I'm not doing this alone. I am back with my main partner in prime, Kevin Philip Fox. As always, no agenda, Kevin. This is like, hey, I'm coming on. My vacation is done. Let's just take half an hour and talk about some football. And there is football to talk about. It is the way that nature intended it, Brian McFadden. I just want to say on behalf of myself, the listeners, the team, it's amazing to have you back in that seat. We miss you terribly. You guys have done an amazing job keeping the train going full steam ahead. Legit Football, cranking, social cranking podcasts, doing amazing. It's nice to know that Legit Football is in a place where I can take a couple weeks off. And it not only stays level, but it actually soars. Myself and Adrian Riveto just constantly say that we're the substitute teachers just wheeling in the TV car. That's really what we are while you're gone. I do my job when you become the full-time teacher and I just become like the principal overseeing the whole thing. I think you'd be a great principal, man. I never had a principal quite like you, Brian, but I wish I did. Brian, the principal McFadden. All right. On that note, as a reminder for those that are in the chat, how we do 30 minutes of football is there is no script. There's no agenda. I've got stuff I want to talk about. Kevin's got stuff he wants to talk about. Anthony, our producer behind the scenes, has prepared some questions, but we haven't shared any of that stuff with each other. So we're just going to roll with it. If you in the chat, if you're live here on YouTube, if you have a question or if you want a topic, just throw it out. We'll go with it. And on that note, Anthony, get that timer ready, because 30 minutes of football with legit football starts now. Kevin's so good to be back. I got a list of stuff here. You kick us off. You're joking. Yeah, you're joking. I've got some stuff to talk about. Let's go. But I'll keep it topical, right? Let's start with Hard Knocks. So Hard Knocks coming out Tuesday, August 8th, his first episode. Let's go. I always love Hard Knocks. You play that intro music for me at any time of the year, but especially now, we haven't had real football since February, and it just gets me chills. Yeah. But I got to say, I'm not sure I've ever been as excited, say for maybe the one year my Dolphins were on, as I am for this Hard Knocks that's about to come. Absolutely. From a storyline perspective, there's never been more. We've already seen. Yeah. We've got the Sean Payton stuff. Sean Payton stuff. We've got Dalvin Cook visiting practice and all. I feel like I've watched a whole Hard Knocks episode already, and it is a week away. You know, I come from the reality TV circles. Brian McFadden, I'm very guilty of enjoying some reality TV. This is what we call in the reality TV circles, this is the preseason of Hard Knocks, right? We're seeing the preseason chatter, the preseason smack talk. It's about to go down, and my only fear for Hard Knocks, because I agree with you, my excitement is at a fever pitch, my only fear, Brian, is that I think Rogers wants to neuter it a little bit. I think Rogers wants to, you know, I think he wants to control the narrative a little bit too much, from what I've heard. I think he's very conscious of how he's going to be picking up the show from what I'm hearing. Yeah, but he can't help himself, Kevin. Did you see when Peter Schrager of NFL Network teed up a pretty basic question, like any reporter would ask, about Sean Payton's comments, and Rogers could have said, oh, you know, we don't worry about that, we're worried about the Jets, you know, blah, blah, blah, can't blah, blah, blah, cliche. And instead, he went off and said, keep my coach's name out of your mouth. He went full Will Smith at the Oscars on that. Oh, we lost Kevin, volume gone. All right, in the chat, Galileo, let's go. By the bell, are we back, baby? There we go. And guess what? Your audio sounds better, because I was going to say something after the show. Your audio didn't sound good. I was just going to tell you how great our producer is. Was it not plugged in? It was fully not plugged in, so I've been coming through a crackly laptop microphone, but we're back, baby. Galileo, the homie, welcome in. Thomas Bray, the homie, welcome in. Thomas, legit design extraordinaire in the chat. Yeah, so so far, Brian, I do think you're right. He can't help himself. He's got his darkness retreat. He's got his ayahuasca. He's fired up. He's ready to make some story. He's coming out. He cannot help to say whatever is on his mind. He might want to mute it and subdue it, but that's not going to happen. We've already seen it. It's not even, you know, we've already seen some of the drama. So I wanted to talk about hard knocks and expand on the Sean Payton thing a little bit. Yeah, might as well with that. We're going to see that. So let's talk first about the Jets. We're both fans of AFC East teams. Right. For getting all the stuff we've already seen, you've got a team on the rise. You've got a fiery head coach. Yeah, you've got an officer coordinator who just came off one of the most disastrous coaching displays, but supposedly is a very well liked coach. Like, so I want to see what happens with Nathaniel Hackett. You've got the offensive rookie of the year. You've got the defensive rookie of the year. It's New York, like the biggest media market there is. And then you add in a three time MVP Super Bowl champion future Hall of Famer quarterback. It's just like, first of all, who else were they going to pick? Hard knocks. No one did they force it down your throats. And number two, are you as excited as I am for this? I absolutely am. And I'm not at all. Yeah, I think the Rogers and the Salah and every other personalities of New York are just going to shine for whatever that means. I don't necessarily think that will be a good thing, but they will be bright. That's for sure. It'll be shining in an entertaining fashion. Exactly. Exactly. And you know, the football guy in me is like, how does Breeze Hall look? You know what I'm saying? That's maybe what I'll be keeping my eyes on most because I'm thinking about Breeze Hall from a fantasy perspective. And so that's something I'll be looking at. Garrett Wilson, Brian, we're both extremely high on him. I think it's impossible not to be with what we saw. Who's not high on Garrett Wilson at this point? He's out of sleeper Tory into like, you know, he very well could be a top five established receiver at the end of the season. It's very likely. So there's so much to look for. And like I said, the entertaining aspect is very much there, but the football side of it is still hot as well. And that's what I'm looking forward to the most. I don't know about you, but I'll be honest. You know, I'm as football junkie as they come. I started an NFL media company. I rarely finish Hard Knocks. I rarely get to that last episode because by then the season starts and it's like, I know what's going on. I know who's cut. I don't want to watch this. I think I might watch this whole one. We'll see how it plays out. I ask our listeners to not cancel us because I know 85% of them same situation. Hard Knocks is like you said, it's for the football junkie in us. It gets us from point A to point B. We joked in the legit football slack about how much of the Hall of Fame game are we really watching? You know, everybody's going to watch kickoff. That is not on my agenda, by the way, to talk about in 30 minutes of football. There is a football game tomorrow night. I will watch at least five minutes just to get like a junkie gets their hit. Like I just need to put it in my veins. But then I'll realize it's really weak stuff and I'll be like, get this out of my veins. Just wait. I don't want this in my veins. Where's the where's the antidote? I don't even I don't get to see Sean. I don't get to see Rogers. I get to see a bunch of backups and Mackay Beckton. I mean, yeah, I think the one thing from the Hall of Fame game that I will be watching is because like you said, we're fans of AFC East teams. I want to see how that, you know, middle to bottom percent of that Jets roster looks because, you know, I think they're a real threat, Brian. And I didn't want to bring it up to you because I don't want to make you sad on your return to 30 minutes. But does the Ramsey injury, does that propel New York over Miami in terms of contenders in the AFC? Because I think it might. It all depends on. So the biggest weakness the Jets have is their offensive line. Yeah. And at that's the one thing in camp, too, that has been a concern. Like they were counting on Mackay Beckton to be a starter. Now it looks like he's already in the second team. Oh, Thomas, he wants to watch Kellen Maughan take on Zach Wilson. I'm kind of excited to watch Zach Wilson. I'll say it. Me too. Because everything that's happened, he's cast aside, man. He's he's the reject. He's he's you know, he's not not the hotness anymore. Oh, we got Oscar in the chat. What about? It's a great. It's a great show. And Oscar pops up in the number one fan on Instagram. I'll start to thanks guys for showing up. But yeah, so the offensive line, I don't think we're going to get a lot of answers to that because the starters aren't playing. Yeah. But there's two things that if they come together, the Jets not only could be AFC East, they could be Super Bowl contenders. The offensive line is one of them because Rogers gets pissed when he doesn't have protection. Oh, my gosh. He doesn't necessarily make mistakes, but he'll yell at his teammates and hold the ball too long. He'll take extra sacks. Yeah. You do not get the prime Rogers if he's running around for his life. So that's number one. Number two, Nathaniel Hackett is still the officer coordinator. Yeah. And he's a good one. I hear he's likeable guy. Like I said, I'm looking forward to seeing what makes him so likeable on Hard Knocks. But we saw him try to call the plays. We saw him try to coordinate an entire team. You know him from your time in Buffalo. He was also an officer coordinator for a lackluster offensive attack in Jacksonville. Yeah. So either they hand the reins to Rogers, which is great a quarterback as you might be. You shouldn't be calling the entire offense. You're seeing it through tunnel vision, through the eyes of a quarterback, number one. Number two, is there going to be too many cooks in the kitchen? Is Rogers going to try to call plays? Is Hackett going to pass off? I don't know. Those are my questions. If those things come together, yes, I'm scared of the Jets as a Dolphins fan. Yeah. And like I said, I don't mean to throw cold water on your excitement. I still think I have the Dolphins sneaking into a wild card spot potentially over the Jets, I would say. Dolphins sneakily have a pretty deep secondary. Yeah. Cader Kouhou was a huge surprise last year. We drafted Cam Smith this year, who a lot of people are really high on. They still have Zavian Howard. He was going to pump to the number two, but he's still a very capable number one. Javon Hall. And apparently in Fangio's defense is just the reports out of camp are like, he's the man. Brandon Jones, great safety. They've got some depth there. They still have Noah Ibn Aghani. None of those guys are Jalen Ramsey. Don't get me wrong. But the fact that Ramsey, you know, hopefully could be back by the towards the end of the season. I don't think it knocks. It's not a huge knock. It's a hundred percent. Yeah, it's nice. It's something you bought, Brian. It's obviously something because you guys use Bob Brian while I was on vacation. Absolutely. One hundred percent. I think it's something, but I think it's not as the sky is that, you know, the sky is not falling. I'll say. I think something that I want to go back to that you said that sort of stuck with me that I'm kind of I want to like tease out a little bit is this Nathaniel Hackett conversation because I saw a really fascinating tweet. I don't remember who was the author of said tweet, but they said, how crazy is it that everybody's acting like it's such a big deal that Sean Payton just verbalized what everybody saw with their eyes. Like how crazy because he's it's so when Hackett did his response today, he said, you know, he's been he was a coach's son, so he's literally been around the game his whole life. It's like an unspoken word, like you don't trash other head coaches in that manner. He's not an analyst anymore. Granted, he wasn't much of an analyst for one year term of Payton. But you just don't first of all, you don't kick a guy when he's down. Hackett knows how bad of a job he wanted. It was his first head coaching gig. Yeah. But that's more the thing. It's not that it wasn't true. It's more like why are you as a as a as a fellow head coach, only one of 32 at any given time, are you going to go and trash a guy who didn't do anything to you personally? Yeah, I don't know. It was important taste. I don't disagree with that. I don't disagree with that. I just I and you know, I do think I understand the controversy because especially in the NFL, we know this from our time watching, you know, the Bengals last year or our time watching Tom Brady play. You give an NFL team a reason to have their chip on their shoulder, they'll take it and they'll use it. And it's not necessarily a bad strategy. It can be great coaching. It can be great motivating tactics. It's motivational 101. You know, if you feel slighted, you might have a little extra gas in your tank. I guess for me, what it comes down to is like we saw Hackett and this is why I think he's likable. This is I'm bringing it full circle. We saw Hackett let Russell Wilson run the show and it was a disaster and it blew up in his face and we saw what happens when a quarterback like Russell Wilson is running the show. Maybe that's why Rogers likes Hackett so much because he lets him run the show. He likes to run the show and it's occurred to me to write like it's definitely a possibility because I can't fathom that Hackett because here's the thing. If Hackett's calling plays, it's going to be run run pass. So, if we see the Jets ever throw on first down, we know Rogers is at the helm. That's what I think. I'm really curious to see how that plays out. I would say this. If they still had Michael LaFleur there calling plays with Rogers and even if Nathaniel Hackett was there as office of coordinator but wasn't calling plays, I would be even more scared of this Jets team. Like you would think, yeah, exactly. You would think highly. Hackett might be an ankle weight right now but we'll see how heavy that ankle weight is because at the end of the day, you've said it on the show a million times. This is the all in move for them. This has to count. Like this has to be the year or at least next. At best three but that's stretching. I would say they've got a two year window and Rogers said as indicated he's going to be there two years which is good news for them. And the contract surely seems to suggest that as well in the maneuvering which was cool. Nice to see Rogers sort of shed his selfish image for five seconds to give the Jets cap space to make some moves. That was no small token move. Historic. Historic. That was 35 million of guaranteed money that he's like, no, I'm good. That was beautiful. I got to say. Respect. There's a little bit of respect for Mr. Darkroom Retreat there. You got to have very measured fingers there. It's very small but it's there. It's something. It's better than no respect. Absolutely. I've got a whole list of stuff. I've got a cool segment I want to do in the second half here but I want to turn it back over to you and see if there's anything you want to talk about before we get to that. Let's do really quick. We have a minute and 30 seconds. Brian, give me a camp fact and a camp fiction. So that's interesting. I guess I'll go ahead and tease it. I've got a list of buying or selling hype guys. Oh, let's go. Okay. That's exactly what I was thinking. So I don't want to... Factor fiction. Maybe we can make it team oriented. So let's do one fact. The Cardinals are a mess. But I think that the compass is actually pointed in the right direction. Definitely. Long term. Fiction. So hard to peel back. It's hard to sift through the rubble. It really is. But let's call our shot, Brian. Tell me what's a lie. What are you hearing that's a lie? I'll say not a fiction but an exaggeration. I've seen a lot of posts about Dak throwing interceptions and I know that he led the league in interceptions last year. He's never had an issue with interceptions prior to last year. He's actually tends to be more on the bottom percentage of one of the quarterbacks in turnover worthy plays. He's good with the ball. A little bit of fiction. If he throws a pick in camp, which by the way all quarterbacks throw picks in camp for various reasons, including the coaches calling plays that they want to see how the defense reacts that sets it up for an interception. So we'll say that's a little bit of fiction. I like that. I think you showed up with that at the buzzer. So it is halftime, Brian, correct? Quick halftime. We'll take a quick moment to remind you guys. Guys, this is all part of Legit Football, which is our daily free NFL newsletter. If you're not already subscribed, do yourself a favor. Go to legitfootball.com and sign up. We've got over 20,000 subscribers at this point. Thousands of you read it every single day. So legitfootball.com, sign up. All the NFL news all year long, five days a week, direct to your inbox. Kevin, let's keep on rolling. Armand, the champ. I was going to say. The champ. We have got to get to the second half. We do have to. I just want to say we have Armand, we have Mike, we have Thomas. I just want to say the chat with six people viewing live. I just want to say we love every single one of you. We're happy that you're here. Keep coming back. We got a show tomorrow. Appreciate y'all. All right. Kevin, I'm down to go into this buying or selling thing. Let's do it, man. I got a bunch of names. Let's go rapid fire. Anthony, throw up that second halftime or get rid of the halftime banner. All right. So I've got 10 names here. And I want to, if we get to the end and I don't say a name that's on your mind, I'd love to hear from you too. I want to go through buying or selling and then a little bit of context and we can both give our opinions, but I'm going to throw it over to you first. Sweet. So this is Camp Hype. Yes, sir. Are we buying or selling? These are all player oriented. Let's start with Cleveland Browns Elijah Moore. Buying or selling the hype coming out about him. I'll tell you what, Brian McFadden, I'm going to buy this hype because we all thought that we had it. He had it before. It didn't end up working out that way, which was really unfortunate. The whole trade request, yada yada, but the talent is there. And if Watson is who people think Watson is going to be this year. That's the bigger question to me is not more. It's Watson because I think we've seen more do it in camps and pre-seasons. We saw more do it in the regular season. The end of his rookie's year ended on a tear and it's just the Jets organization fell apart and Zach Wilson turns out can't play the guitar. So yeah, I'm with you. I am buying Elijah Moore. The question is what that quarterback play is going to be like. That's the big thing. Yeah. If he shows up and is the guy who he was pre-situation, which a lot of people seem to think he's going to be, Brian. I don't know about that one. That's a question for another day. I purposely didn't put him on here about buying or selling. I just want to wait and see it. I don't want to speculate on him. Obviously I've got my personal feelings about all the stuff that he's done. We all do. Right. So I don't want to go into that. But Elijah Moore, we're both in agreement. We are buying at least his individual talent. Big time. Let's go to LA where you're located to Rams camp. How about late round drafted? I think it's six, fifth or sixth round out of Utah. Rookie wide receiver, Puka Nakua. I knew you were going to say that name. Buying or selling? I'm going to buy the talent. I don't know if I'm going to buy productivity right off the bat, but I think it'll make the team and I think he'll. But if you're talking about for productivity this season, I'm going to sell it. Well, the Cooper Cup injury. So there's a few things. One is even if Cooper Cup is fun, which hamstring Mr. Preseason, but it looks like he's lined up to start for week one. Even without that though, they linger. Who do they have behind him? Yeah, no, it's true. He is in a good position because the Rams had, what did we say? Like 40 rookies after the draft. The youngest team in the league. And their wide receiver core, Allen Robinson is only there a year, gone. Odell Beckham two years ago, gone. So they're left with Van Jefferson, who is solid, but is nobody's idea of a superstar. Good, but he's not like a playmaker. Let's shell him into the number two. Who's in number three? Tutu Atwell, Ben Skoronek. It might be Puka Nakua. Demarcus Robinson is there now. Why not Puka Nakua? Yeah, I guess I'll buy, but like from like a perspective of like wide receiver three numbers on a team, that's like, I'm projecting did not be great. I would say buy, but buy just a few shares. Yeah, I'm not going all in. But I want to get a couple of these just in case it pays off. Buy a few of those cheap lottery tickets. We all had a little bit of Dogecoin. Exactly. Let's stay in the NFC West. And I think this is going to be unanimous for us, but I'm just going to throw it out there. Not too far from me, right next to Levi's Stadium. Let's go to Brandon Iyuk out of the 49ers camp. Nothing but not just good rave reviews from every single 49ers beat reporter that this is the year Brandon Iyuk becomes like a top 10 receiver in the NFC. Yeah, I'm buying or selling. Buying with as much money as I have. I'm taking out a second mortgage. I am too. McFadden. I'm a quarterback issue there too, but I think, you know, I'm a believer in Purdy. I think he'll step up. I think Lance is QB3 at this point. Which is just insane. Darnold in this offense, I kind of want to see. I was going to ask Darnold, Brian, buy or sell? I think he's going to start as a number two, and I think Purdy is a starter as long as he is healthy or if he does a 180 and suddenly starts struggling. So I think it's Purdy's job to lose. But I do think Darnold starts as QB2. I do think he gets ahead of Lance. Do you buy that he's legit or do you think this is just lesser of two evils? We have not podcasted together since Playmakers came out. Tell me you have heard Playmakers. I've heard about it. There's so much hype. Oh, you're doing it to service you haven't already heard it. So it is phenomenal. So Jordan Rodriguez, who works for the Athletic, covers, she's a beat reporter for the Rams. She did a five part episode. If you guys are listening or watching at YouTube, if you haven't seen Playmakers and you like football, you're crazy. Go do it now. It is an amazing series. It is all about the Shanahan coaching tree. It focuses on the four main ones. So you've got Kyle Shanahan, Matt LaFleur, Mike McDaniel, and Sean McVeigh. So those are the four and it gets into their, from their time all in Houston when they were all in their 20s, like in the offensive quality control room, did all their various stops, but just the way they think and it really breaks down their thought process when it comes to their offense and it all starts with Kyle. Point being we've always, we know that the Shanahan offense is good. We know that it's quarterback friendly, but if you understand how that man thinks about football, every quarterback is going to play better in that system than other systems. Interesting. So somebody like Darnold with all of that talent. Yeah. Cause I mean, I'm a huge Purdy fan. He doesn't hold the talent of Sam Darnold. He just does the physical quarterback talent. So do I think Darnold could excel in this if he masters that offense? Yeah. Kind of think I do. If you know, if you know that the guy that's playing the ball low is completing like 44% in camp and Vegas and can't hit the deep ball, he went to a Superbowl. Literally. Yeah. We have, we have Thomas agreeing with you. We have Mike agreeing with you. We have Armand dogging Darnold. So the chat is alive and well. I need discourse. I love this. Brian, who's the next name you have on your list? All right. Let's go back over to the AFC. The resurgent player who hasn't played in a year and a half, but it's nothing but fire coming out of camp. Calvin Ridley buying or selling. Oh, you have to buy it just because we love football. We gotta sell some of these. We're like buying all of these. I mean, you got good ones, man. You, you, you brought it, you brought it. I think I did. I think, I think my bias is showing him. I like him. I like him. You were like, you were like, this segment is called buy and I'm going to tell you everybody we're buying. We, I got to think of, uh, yeah, we're both buying there. I don't need to go into, I think, I think Calvin Ridley has top 10 wide receiver potential. He's literally done it before. Yep. Um, and you've got an amazingly talented quarterback and a great offensive mind and Doug Peterson, the Jacksonville to the moon, especially in that division. Um, let's see. Now I'm trying to think of so, cause I literally, I'm buying all of the, okay. And then we can, no, let, okay. Yes. The one at the bottom, I'm actually not buying. I just realized that I got nine on here that I'm buying and one that I'm selling. Shoot. We'll get to, we'll get to the selling one and maybe we'll try to pivot. Otherwise, if you have anybody, you and the chat have somebody that you're selling out the hype, you're not, you're not buying into, let us know. Um, so let's go through the rest of these names. Calvin Ridley, we both agree. A hundred percent. There's a certain tight end in Buffalo. If you, you don't, you even go there. I don't even want to hear this. I got him in one of my two dynasty leagues. I'm very excited that I do have Dalton Kinkade. Um, I love, so this is not your cell. Oh, you're back up. Okay. I thought you were here. Okay. So why I'm buying Kevin, that would make for good entertainment. Maybe it's how they're going to use him. The there's, there's two issues with why rookie tight ends tend to have a longer learning curve is one of the hardest positions to transition to as a rookie in the NFL. Uh, one of them is there's always the speed of the game. That's for every position. So I don't include that. One of them is the different terminology, the different kind of playbooks that they have to master that most college tight ends aren't asked to learn about. So there's just so much more that they have to digest. That's number one. Number two is blocking is that most college tight ends are just not really asked to block their, their either solely a blocking tight end or they're receiving tight end NFL tight ends. You have to know how to block because you only have so many players on your roster. Your entire scheme relies around, you know, having an extra office alignment in this case to tight end, but what I like about Kincaid is they're going to be running a lot of 12 personnel. Absolutely. That's one running back to tight ends. They Kincaid doesn't really need to do a lot of inline blocking, at least not as a rookie. So what it does, uh, we saw this with Kyle Pitts, say what you want about Pitts. Pitts had a very good rookie year for a tight end and it's because they were aligning him out in the slot and putting them in the X and Y spots. He didn't have to do as much inline blocking. So that is why I'm buying Dalton Kincaid. Absolutely. My friend, I'm glad you bring it up because I've been waiting for an excuse to talk about it. Um, we pulled on the Dalton Kincaid thread from camp on legit football. Maybe last week, Brian, it's no brainer. It's the same dunk. He's Josh Allen's slot receiver. Okay. I don't, I know he's not literally a slot receiver, but he's going to be operating out of the slot as a route runner. He is so fluid. Watch, watch any film of Dalton Kincaid from his college days. Watch any of the camp clips. There's just, he looks like a gazelle. There's a smoothness to the way that he runs. And everybody likes comparisons. Even before he got drafted, a lot of Kelsey comparisons with the way that he moves in and out of routes. That was never a question. My question was all about the timeline of rookie tight ends, just because they're at such a learning curve. But if they're going to align him primarily outside, that learning curve gets reduced. He still needs to learn the terminology. He still has to learn how to block, but he does it. He'll be on the field more because they don't need him to block. That's one of the differences is they can't put a rookie tight in there. It's going to get destroyed. We just saw, I don't know if you saw this, Michael Mayer in Vegas getting destroyed by Max Crosby. I can't have that. Turned into a little child. This is Michael Mayer. Everybody thought he might be the number one tight end. So those are the kind of things that, and that's normal by the way, that's what most tight ends deal with. The fact that they're going to align him outside, huge advantage for Kincaid in his rookie season. I'll say as extreme of a buy as I'm going for, Brian. I'm not a Jersey guy these days. I had a, when I was younger and growing up, I was a fan during the drought, bought a lot of jerseys and I threw them out within a year or two, gave them away because they were immediately not on the team. So as a Bills fan, I learned not to buy jerseys. I have a couple now. I have a Josh, I have a Diggs. I'm thinking about getting a Kincaid, Brian. That's how much we buy, Ryan. First round tight end. That's how much we buy, Ryan. We got just under four minutes left. I want to get to these names. Mike Elmore on Facebook. Nice to see somebody watching us live on Facebook. For those that don't know, we always go live on LinkedIn, Facebook, Twitter, and right here on YouTube. Mike says he's buying Jared Goff selling Daniel Jones. I'm guessing, I just read he said Daniels. I'm guessing he means Daniel Jones. I think he means Daniel Jones. Well when it comes to golf, he's buying as well. In my head, it was Daniel Jones. I know, because you're selling too. I know. I'm definitely selling Daniel Jones. Gotta buy golf. I'm not selling Dimes. I think Dimes is going to be A-okay. You know, I believe in Dayball. Yes, I'm a Dayball fan, which is why I think Danny Dimes got to where he did, but I think that's his ceiling. That's the thing. I don't think there's more from Daniel Jones that we haven't seen yet. Maybe they've improved performance in the playoffs, but other than that, yeah, pretty darn close to the ceiling that we had there. Oh, here's a good one. Armand, always great coming out with questions. Which rookie wide receiver would you sell right now? Quinton Johnson, Jordan Addison, Mingo, or Jackson Smith and Johnson? I'm going to sell Johnston because of the volatility of him as a prospect in general. And I think Alan Williams and the Chargers weapons that are already established will keep eating. I think eventually he'll be great, but I'm selling for now. Wow. Only one of these guys has... Bot Kevin makes an appearance. Only one of these wide receivers has already gotten in trouble. And that's Addison, who was speeding what, like 85 miles per hour? You heard why, though. Something about the pet, his dog. He had a sick pet. I can't say I wouldn't do the same. I don't know. The point is only one of them got in trouble. That's fair. Yeah. I was not high. I will say this. I was not high on Johnston coming out. There was a lot about his game I didn't like. I loved the yards after catch, but he's like a big guy who doesn't win contested catches. And he's been having trouble with drops in camp. So let's use this to transition into another guy on my list. JSN. That's a positive high coming out of Seahawks camp. Yeah. Did you see the stat recently that showed him, Garrett Wilson and Olavi, I think it was all in Ohio State and he had like 700 yards more than both of them on the same Ohio State team? Brian. And he's with Lockett and DK, bro. They can't... Who are you going to double there? Dude, Seahawks, man. That receiving corps is a sleeper contender for best in the NFL. I think Miami and Cincinnati will always have something to say about that. I'm definitely buying that. JSN, this whole wide receiver rookie class, I wasn't too high on. JSN, the first receiver taken at number 20, but I'm buying everything. I feel like I'm pretty good at sorting through the smoke. When there's just enough of it where it's like, okay, everybody's saying this, they're seeing the same thing. That's what I think is happening. One minute left. I want to run through the rest of these. Let's give our boy Anthony a little bit of... same Laporta, buying or selling. I think you have to buy because the Lions passing attack is going to be so high volume and they're missing one of their top projected receivers for the first, what, six games. I think Laporta will have a chance to establish himself. He's already operating his tight end one according to Anthony, so I like the buy of Laporta. So I'm going to not sell, but I'm going to hold on him just because he will be like an inline tight end. He's going to be asked to block more. I think long-term, great buy. I think this season, maybe King K does much better from a production standpoint. All right, let's go to the defensive side of the ball. Manuel Mosley, interceptions left and right in Washington camp. Dude, I'm stoked about this, man. I'm stoked about him. Ten seconds. Keep it quick. Oh yeah, no, buy. 100%. Buy. All right, and Bijon Robinson making everybody look silly. Cornerback skater. Sell. Sell. I'm buying with all the cash I have. Additionally, I know we just hit the timer, but Darren Waller, all the beat reporters, 31-year-old always injured Darren Waller by yourself. Here's my hot sell. This is my hot sell. It's not my hot sell. I'm selling too. It's not that high. This was the sell I had on the list. I've been hearing that he's like the man, but just his health. He won't stay on the field. Exactly. I just refuse to believe it. At this age, yeah. We're both in agreement on everything, Kevin. Yeah, that was weird. That's not supposed to happen. The only one that we did, I think you're higher on Puka than I am. I think Puka will take time as well. Puka was a hold. I didn't really go into that. Puka was also a hold. He surprised me. You remember Lance McCutcheon was everybody's darling last year. He might not even make the team. We are out of time. I know Mike Elmer, top three defenses. Bills, Eagles, 49ers. Niners. Yeah, Niners and Eagles have to be the first two on there. Yeah, I can live with that. I can stomach that. Yeah. All right, so we're wrapping up. Thank you so much for everybody. That was awesome. In the chat, great show. We do this every Wednesday, 8 p.m. Pacific, 11 p.m. Eastern, 30 minutes of football. Mike says the Cowboys can't really. They got Stefan Gilmore now and they had a great defense last year. I can't argue with that. I could go with Dallas at number three. Kevin, it has been a pleasure. I am back. I'm not going anywhere. Great to have you. Enjoy some Hall of Fame preseason football tomorrow. Don't forget legit football Tuesdays and Thursdays now, right Kevin? Hell yeah. Tuesdays and Thursdays in the 230 Pacific range. We'll be working that out. But yeah, we want to maximize our show times. So Tuesday and Thursday. All season long, you've got legit football pod Tuesday, 30 minutes of football on Wednesday and legit football pod on Thursday. You're so sick of us. Oh, they love us. That's why they're here. Thank you guys. Everybody, if you see your first time here, please like and subscribe. Thank you to my partner in crime, Kevin, Phillip Fox, Anthony, Wainer behind the scenes. I'm Brian McFadden on behalf of legit football. This has been 30 minutes of football. We'll see you next time. Why do you hate Tyree kill? Wow. I see. Another spoiler. Justin Herbert is on my hot seat. Yeah, that is the bucks where they still had top rate. Yeah, that is the bucks where they still had top rate.", "episode_audio_url": "https://www.buzzsprout.com/2007873/13341610-30-minutes-of-football-august-2nd-2023.mp3"}, "podcast_summary": "In this episode of the podcast, the hosts Brian McFadden and Kevin Philip Fox discuss various topics in football without any script or agenda. They mention their excitement for the upcoming season of Hard Knocks, specifically focusing on the Dallas Cowboys and their quarterback, Dak Prescott. They also discuss the potential of rookie wide receivers, such as Elijah Moore of the New York Jets and Puka Nakua of the Los Angeles Rams. The hosts express their optimism for wide receiver, Calvin Ridley of the Atlanta Falcons, and tight end, Dalton Keene of the Buffalo Bills. They also touch on the performances of other players, including Brandon Iyuk of the San Francisco 49ers, Manual Moseley of the Washington Football Team, and Bijan Robinson, a cornerback for the Pittsburgh Steelers. Overall, the hosts are excited and enthusiastic about the upcoming football season and are looking forward to seeing how these players perform.", "podcast_people": "Hosts: Brian McFadden and Kevin Philip Fox\n\nStarring Guests: None mentioned", "podcast_highlights": "Key moments:\n- Discussion of the excitement for the upcoming season of Hard Knocks.\n- Speculation about Aaron Rodgers' control over the narrative on the show.\n- Anticipation for the New York Jets and their rookie wide receiver, Elijah Moore.\n- Highlighting the talent of rookie tight end Dalton Keene and his potential impact in the Buffalo Bills' offense.\n- Positive reviews of rookie wide receiver JSN in Seattle Seahawks camp.\n- Doubts about the reliability of San Francisco 49ers' tight end George Kittle due to injury concerns."}