{"podcast_details": {"podcast_title": "WSJ’s The Future of Everything", "episode_title": "Meet the Soft Robots Doing the Hard Jobs of the Future", "episode_image": "https://megaphone.imgix.net/podcasts/914e8e84-33f5-11e7-92ed-d799e1f645ed/image/future-of-everything-v4.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_audio_url": "https://pdst.fm/e/chrt.fm/track/1F1B1F/traffic.megaphone.fm/WSJ7405371527.mp3?updated=1692353124", "episode_transcript": " This podcast is brought to you by US Bank. Dedicated leaders deserve dedicated support. That's what US Bank is for. From corporate and commercial banking and payment solutions to investment services, US Bank offers all the guidance you need. Learn more at usbank.com. Picture a robot. The first thing that comes to mind is probably something from a movie or a TV show. It may have special abilities like super intelligence. Take Hal from 2001 A Space Odyssey, or Eve from WALL-E taking scans of its surroundings. This robot probably spends most of its time around humans, think C-3PO from Star Wars, or Rosie from The Jetsons. But in real life, robots that interact with people and even look sort of human? They're not all that common. Most of the robots in use today are the kind you've probably never seen in person. So if I ask you to close your eyes and envision a robot, other than science fiction examples, you're probably thinking about some big bulky arm made of aluminum or steel or something that's welding doors on cars in an assembly line. That's Rob Wood, a professor of engineering and applied sciences at Harvard University. He runs a lab focused on designing the materials robots are made of at large and very tiny scales. He and others in the robotics industry call these hard or traditional robots. These kinds of robots tend to be made of hard materials like plastic and metal, which makes them good at certain kinds of tasks, like on an assembly line. Traditional robots, they're powerful, rigid, and they're relatively easy to control. Things that robots excel at includes things like factory automation, things where you'd have highly dangerous, repetitive, high force, high precision kind of tasks. Yes, these robots are great for repeated tasks, but they're also pretty limited in the kinds of movements they can make. Those are not the robots you'd want, say, handing you an extra napkin at a restaurant. Your napkin, sir. Because they might miss and knock all the glasses off the table. But there's a growing field of robotics that's built differently. These robots are made of flexible materials and are designed to do things that require a gentler touch. The field as a whole is usually called soft robotics, though there are a few terms that Wood uses to describe the robots themselves. So soft, compliant, flexible, malleable, whatever permutation of the word is, it all means essentially the same thing to me. And that's basically getting away from the more traditional robots. That have been used for the past several decades for robots. Instead of materials like metal, soft robots are made of things like rubber, silicone, and soft plastic. The things that make them move are actuators and pumps, which can be soft too. These robots are starting to be used in industries like manufacturing and medicine, and they're making a difference. But in the future, soft robots could do even more beyond the factory and the doctor's office. There's a huge range from consumer entertainments, but even more importantly, biomedical devices that are going to just explode in their uses. And perhaps even dwarf more traditional robot uses. From the Wall Street Journal, this is the future of everything. I'm Alex Osola. Right now, soft robots are kind of rare, but in the future they could be doing everything from helping with medical exams to serving us meals. Getting there will take innovation, engineering, and a bit of trust. Stay with us. As a Citi National Client, you get a dedicated team of banking professionals working alongside you. From a relationship manager who works with you on everyday business needs to a business banker who drives your goals into the future. Come in to meet your team at Citi National Bank. See what personal can do for you at CNB.com. Soft robots have been around since the 1950s, but it's only recently that they've started to find real-world uses. Part of what's changed is simply how accessible soft robots are. Here's Harvard's Rob Wood again. If I wanted to go make a traditional robot, I've got to have a pretty heavy infrastructure around me to be able to do that. I've got to have an excellent team of designers, electromechanical expertise. I've got to have a pretty well-stocked machine shop. For soft robots, on the other hand, I can get away with a $500 3D printer and $50 worth of silicone rubber and I can make a lot of things. One thing that companies are already putting to use? Soft robot claws. You know, like in the movie Toy Story. A claw! Actually, Wood says adding a soft robot to a claw machine wouldn't be all that useful in helping you grab little alien toys. But they are useful in grabbing other things, like chicken. Tison Foods supplies about 20% of the beef, pork, and chicken in the U.S. It has over 100 manufacturing facilities where animals are harvested, meat is butchered, and the product is packaged up before it heads to a grocery store. So the challenges that come up in Tison's plants aren't necessarily the same as those in other kinds of factories. What makes us a little bit unique is that we are in the food space. We have hygienic challenges, we have sanitation challenges. And the material we are working with is organic. It is not structured like a car park, right? It could be slippery. It's not always the same shape. That's Chetan Kapoor, the head of automation at Tison Foods. He says Tison started using soft robotic claws in some of its facilities about three years ago. We do have soft robotics used in assembly operations. We are using them for putting chicken breast into a tray. When you go to a grocery store, you buy a tray of chicken breast or chicken drumsticks, right? Somebody had to put that all into a tray and make it look good and make it fit in there. That kind of work is being done by soft robotics type of solutions today. Here's how it works. The system has a camera that detects and figures out how to pick up the piece of chicken as it's coming down the conveyor belt. Then an air-powered gripper, that's the claw, moves into position to pick up the chicken. The claw extends, grabs the chicken, and places it into a tray sitting off to the side. Kapoor wasn't able to tell me what kind of impact the soft claws have had on Tison's output. But he says the robots are making their way into more of its facilities. And he says that the tools still have room for improvement. He'd like to see the sensing technology get better so that the soft robot claws can do more than one thing at a time. Now we're asking, hey, Mr. Robot with your soft gripper, not only pick and place, but also tell me whether that was a good item to place or should the quality have been rejected. So now additional burdens are being placed on the technology for it to be deployable in these kind of facilities. Yeah, robots are not exactly known for their ability to multitask. That's right, that's right. But it's getting possible. What effect does all this have on the humans who work alongside the robots? Kapoor says it can actually help them by automating some of the more dangerous aspects of their jobs. But Mark Lauritsen disagrees. He works for United Food and Commercial Workers International Union, which represents about 30,000 Tison workers all over the US. Lauritsen says he's all for automation that makes people's jobs safer, but not for the kind designed to replace them. Automation can be good depending on the point of where you start the discussion on automation. If it's worker assistance and it's safety, that's a good place to start. If it's just a question of how do I increase productivity or replace the human labor, you're starting from the wrong place and when you start from the wrong place, you'll never get to the right place. These soft claws are being used in industries beyond meatpacking. Candy Maker Just Born uses soft claws to produce peeps, those chick-shaped marshmallow treats you might eat around Easter time. The company sent me this video showing how its claw works. The next part of the process is where the chicks or bunnies or whatever shape we're making is placed into their trays. And remember Rob Wood from Harvard? His team developed a soft claw to gently collect samples of plants and animals that live deep in the ocean. This is the sound of one of those claws closing around a piece of coral underwater. That's actually one of the ways that we started making soft hands is by the desire to, I would say, do more exploration of unexplored deep ocean environments and do it in a way which is non-invasive and really sort of gentle to the organisms and the ecosystems that we see down there. Okay, so soft robot claws are doing lots of gentle grabbing to package up chicken and study the deep ocean. But soft robots don't have to look like claws. In medicine, one soft robot is designed to get deep into our lungs. When a patient has symptoms like a chronic cough and shortness of breath, their doctor might suspect it's being caused by a nodule or mass in the lung. To get a better sense of what's going on, the doctor may order a procedure called a bronchoscopy. Dr. Sanket Thakur is an interventional pulmonologist at the Yale University School of Medicine. And he says he does up to 400 of these procedures every year. So the traditional bronchoscopy would be that you have a big long black tube, has a camera on one end that goes inside the patient's mouth or through the nose inside the windpipe or trachea and then inside the lungs. And then we do whatever we have to do depending on the patient. For Thakur, a bronchoscopy is a physical task. He holds the bronchoscope during the whole procedure and manually directs it into the lungs using its built-in camera and his own knowledge of anatomy. But he says the tool itself has limitations. So if you think about the trachea or the windpipe, that first division is to the right lung and the left lung. And after that, just like the branch of the tree, it divides into these tiny, tiny multiple airways. With the traditional bronchoscope, it was really hard for us to get into the periphery of the lung and to get to that nodule exactly where it is. Thakur says pulmonologists, no matter how skilled, could really only get to the middle parts of the lung. But most tumors are outside of that, in the peripheries. To get to those, doctors sometimes have to go in from the outside of the body. By sticking a needle through the chest wall. The downside to that approach is the risk of lung collapse is 20% or more. Some of those patients will end up in the hospital with a chest tube to treat the collapsed lung. And all this is just to get a diagnosis. Thakur says one of his patients opted against surgery because the diagnosis was so painful. But starting last fall, Thakur's clinic started doing a new procedure, a robotic-assisted bronchoscopy. The robotic bronchoscopy is thinner so it can go really far into the airway. The tool is really thin. It's got a maximum diameter of about 3.5 millimeters. If you've got wired headphones, that tiny plug at the end of it, it's that small. For Thakur, the thing that makes the biggest difference is that the robotic system guides him to the nodule. Instead of looking through the camera and feeling where to go in the lung, he's got a tool that shows him where to go. He can steer right to the nodule, like he's driving a car in a video game. It's very stable because it has shape-sensing technology throughout the length of the bronchoscope. So it will know exactly where it's supposed to be. And there is a navigation software, like a GPS. And when things are better for doctors, patients benefit too. The robotic-assisted bronchoscopy makes it quicker for doctors to biopsy more of the lung. That makes it easier to detect lung cancer early. And lung cancer is the leading cause of cancer death in the U.S. So earlier detection could mean more success in treating it. And Thakur says the robot comes with fewer risks, too. With the robotic bronchoscopy, when we take a biopsy, the risk of lung collapse is around 1%. So there is a dramatic difference from that standpoint. That's not to say it's perfect. Thakur points out that traditional bronchoscopy can do a few different things, like removing a tumor and placing a stent. Right now, the robotic-assisted bronchoscopy can only do biopsies. And it's pricey. Intuitive, which makes the Ion robotic-assisted bronchoscope that Thakur uses, says it generally does not discuss pricing. But similar models from other manufacturers run upwards of half a million dollars. Intuitive got FDA approval for the device in 2019. And since then, at least 376 of the systems have been installed around the country. For his practice, at least, the core says robotic-assisted bronchoscopy has been a good thing. Our initial plan was we were to do about 20 cases a year with the robotic bronchoscopy. And we have done over 100 in less than six months. So we have done tremendously well from that perspective. And it just shows us how the referring physicians who send us the patients are happy the way the program is. So manufacturing and bronchoscopy are two of the ways that soft robots are being used today. But in the future, we could see them doing a lot more. We'll get into some of those cool and slightly creepy future applications after the break. Erich Akam is a true believer in the potential for soft robots. There's a certain magic to these complicated mechanical systems that are designed and built to produce some specific type of motion. He started working with soft robots in 2015 when he was a PhD student. For the past five years, he's worked for the startup Artemis Robotics, where he's now the CEO. Artemis sounds like the Greek goddess of the hunt. But if you look at the spelling, it's a combination of artificial and muscle. We're totally focused on soft robotics and sort of realizing the potential of soft actuators and artificial muscles. He showed me one of the devices his company's working on. What I'm holding here is one of our actuators, which is a piece of plastic film, really. We formed it into several pouches, and each pouch contains some liquid. And then this black part you see here, these are electrodes. And so what happens is we apply voltage to the electrodes, and our plastic pouch here will change shape. Akam says that, eventually, a device like this one could help provide a sense of touch in virtual reality. You think about virtual reality, augmented reality, the vision part of it is figured out pretty well. But the touch aspect of how we interact with the virtual world is not quite figured out yet. So that thin plastic pouch can easily be integrated into a wearable, like a fabric glove or something. If you're in a virtual world, you can get very localized vibrations or taps. Or a lighter, pump-free blood pressure cuff. We have localized pumping. Gets rid of the need for an external pump and just makes the system portable, quiet. But right now, it's still a prototype, so it's not for sale. Now, the reason for that, we're using inexpensive materials, but the production process is still pretty manual. And then the other reason is that our electronics are quite expensive. We're looking at ways to reduce that cost. All of this, too, is sort of a side effect of being early on. At scale, the prices go much lower. But today, at the volumes that we're making, these actuators and the electronics, it's much more expensive. Not operating at scale means business isn't exactly booming yet. In fact, Akam says the company is primarily being kept afloat through government grants. He says Artemis Robotics has received about $4 million in federal grants since 2020, including from the National Science Foundation, NASA, the Army, and the Department of Energy's Advanced Research Projects Agency, or ARPA-E. But Akam says soft robotics as an industry is in that place between well-funded academic research and commercializing at scale. There's a name for the stage of development of a new field. You have to traverse this valley of death. Some people call it the chasm. The valley of death. When a company runs out of money before its products become commercially successful. But many predict that soft robots' future is huge. The market research company BCC Research predicts that the global market for soft robotics will reach over $4 billion by 2026. That's five times bigger than it was in 2021. In order for soft robotics to live up to that potential, Akam and others agree. It needs a blockbuster application. To get out of the valley, I think it'll take the really nailing down what are the problems we can solve with soft robotics. If you've looked around at some of the academic research, there's a lot of really cool demos. And it's exciting technology to look at. And it's easy to imagine this faraway future, how they could be useful. But the key thing is to figure out what's a problem actually that needs to be solved and that can be solved with soft robotics. One company that thinks it's getting closer to the answer is the company that's closer to the answer, Bridgestone. You might know them as a Japanese tire company, but they've actually been working on soft robots for decades. It's been about 40 years developing rubber muscle technology. That's Masahiro Yamaguchi, a founding member of Bridgestone's Soft Robotics Ventures, the sort of in-house startup focused on soft robots. I reached him in Tokyo on a recent early morning. Well, it was night for me in New York. The company may have started working on this decades ago, but he says initially it was too early. There just wasn't a market for soft robots back then. The market needed fast, precise, and powerful robots. But now, Yamaguchi thinks things might be different. Our very first application is Robot Hand, powered by rubber muscle. Yamaguchi says he and his colleagues have been working on the soft robot hand for the past five years. This is a clip from a promotional video Bridgestone made for it. This isn't the first robot hand we've seen, but Bridgestone's looks different. It's got long, skinny fingers that remind me of the hot dog fingers from the movie Everything Everywhere All at Once. She appears to be in a universe where everyone has hot dogs instead of fingers. Why are the fingers so long? It's like so creepy. He says the robot hand works better like that. Plus, it's distinctive. Yamaguchi says his team's been testing the hand with a few partners and plans to launch it commercially next year. He says its first uses will be in fulfillment centers, the places that package up stuff you buy online. Traditional robots are already doing this in some places, so this use isn't much of a stretch. But Yamaguchi thinks the hand's future will bring it into closer contact with humans. We believe our robots in your daily life are not replacing your tasks. They do creative things together, like cooking, because the future we can picture or draw anything. We try to create a market. What could that market look like? Today, there are robots that do things like cook and mix cocktails, but they're rare and expensive. Adding soft robotic materials, which can do different things, could help make these devices more commonplace. Beyond these uses, though, Rob Wood, the researcher at Harvard, says future robots that combine soft and traditional materials could solve problems we haven't even thought of yet. If I really am trying to aim at solving a long-standing robotics challenge in a new and interesting way and maybe using different materials and soft materials, yeah, you've got to be creative, right? You've got to sort of have a vision for what this new type of robot would look like and how it would be used. It will take more engineering work to give robots more functionality. Sanket Lakhor, the pulmonologist, says he hopes one day the robotic-assisted bronchoscope won't just help diagnose cancer, it can also help treat it. Ultimately, down the road, there is a possibility that we might get to a point where we drive with the robotic bronchoscopy to the nodule, we take a sample, a pathologist will look at that in the room, tell me that there's a cancer, and we go and burn that nodule right away and that's it. The patient has a diagnosis and treatment in one setting. More sophisticated soft robots could also wind their way into other aspects of medicine. They could improve colonoscopies and make surgeries less invasive. But before that can happen, Eric Acom at Artemis Robotics says engineers will have to ensure the software and the hardware work more harmoniously. There's the grand vision, right, of we'll have soft robots that maybe are like our robotic companions or soft robots that you can wear as like an exoskeleton that help you maintain mobility as you get older. But in the short term, the technology isn't there yet. Plus Rob Wood points out that being able to trust robots to live and move among us is a challenge almost as big as the engineering itself. If I could make a robot that's in 10 years could mow my lawn and then walk my dog and then make dinner for me and then whatever, right? Sounds great. Would we accept that or would we trust it? So I feel like there's other non-technical barriers that also have to be overcome. But Wood is pretty confident that it'll get there and that the day will come when robots, soft or otherwise, are part of our daily lives. I do think robots. They're going to be ubiquitous, they're going to be assistants, they're going to be taking care of us, they're going to be doing chores for us, they're going to be helping with biomedical procedures, they're going to be adding new hands, right, to matters that really count. The Future of Everything is a production of The Wall Street Journal. Stephanie Ilgenfritz is the editorial director of The Future of Everything. This episode was reported and produced by me, Alex Osla. Our fact checker is Aparna Nathan. Michael Laval and Jessica Fenton are our sound designers. They also wrote our theme music. Aisha El-Muslim is our development producer. Scott Salloway and Chris Dinsley are the deputy editors and Falana Patterson is the head of News Audio for The Wall Street Journal. Like the show? Tell your friends and leave us a five-star review on your favorite platform. Thanks for listening."}, "podcast_summary": "Summary: This episode of \"The Future of Everything\" podcast explores the field of soft robotics. Host Alex Osola speaks with experts in the field to discuss how soft robots are designed using flexible materials like rubber and silicone, and how they are being used in various industries such as manufacturing, medicine, and exploration. The podcast also delves into the challenges and future potential of soft robots, including their impact on job automation and the need for trust in these machines.\n\nHost: Alex Osola\nStarring Guests: \n- Rob Wood: a professor of engineering and applied sciences at Harvard University, who runs a lab focused on designing materials for robots\n- Chetan Kapoor: the head of automation at Tyson Foods, who discusses the use of soft robot claws in their manufacturing facilities\n- Dr. Sanket Thakur: an interventional pulmonologist at the Yale University School of Medicine, who talks about the use of soft robots in bronchoscopy procedures\n- Erich Akam: CEO of Artemis Robotics, a startup focusing on soft actuators and artificial muscles\n- Masahiro Yamaguchi: a member of Bridgestone's Soft Robotics Ventures, who discusses the development of a soft robotic hand", "podcast_people": "None.", "podcast_highlights": "Key moments from the podcast:\n\n1. Introduction to the concept of soft robotics and the difference between hard and soft robots.\n2. Soft robots are made of flexible materials like rubber, silicone, and soft plastic.\n3. Soft robots are being used in industries like manufacturing and medicine.\n4. Soft robot claws are used by Tyson Foods to place chicken into trays in their facilities.\n5. Soft robots are also being used by candy maker Just Born to produce peeps.\n6. Soft robot claws are gentle and non-invasive, making them suitable for exploring deep ocean environments.\n7. Soft robots are being used in medicine, such as the robotic-assisted bronchoscopy, which helps detect lung cancer early with minimal risk.\n8. Soft robots have potential applications in virtual reality, touch-based interactions, and improving medical procedures.\n9. The soft robotics industry is predicted to grow significantly in the future, with a market value projected to reach over $4 billion by 2026.\n10. Challenges in soft robotics include improving production processes, reducing costs, and increasing trust in robots among humans.\n11. Soft robots could become ubiquitous and assist humans in various tasks, including chores and biomedical procedures."}